# Создайте несколько переменных разных типов. 
# Проверьте к какому типу относятся созданные переменные. 

data = 42
print(type(data))

data = 42.5
print(type(data))

data = 'abs'
print(type(data))

data = True
print(type(data))